zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10064.atdf
<?xml version='1.0' encoding='UTF-8'?>
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="4.5" public="true" xsi:noNamespaceSchemaLocation="https://schemas.microchip.com/com/microchip/atdf/4.5/atdf.xsd">
  <!--
 Copyright (c) 2025 Microchip Technology Inc.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
  <!--
CHPMKR VERSION: 2.21.1
-->
  <variants>
    <variant ordercode="PIC32CM6408PL10064-I/5LX" package="VQFN64 WF" pinout="QUAD64MVIO" speedmax="24000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5"/>
    <variant ordercode="PIC32CM6408PL10064-E/5LX" package="VQFN64 WF" pinout="QUAD64MVIO" speedmax="24000000" tempmin="-40" tempmax="125" vccmin="1.8" vccmax="5.5"/>
    <variant ordercode="PIC32CM6408PL10064-I/PT" package="TQFP64" pinout="QUAD64MVIO" speedmax="24000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5"/>
    <variant ordercode="PIC32CM6408PL10064-E/PT" package="TQFP64" pinout="QUAD64MVIO" speedmax="24000000" tempmin="-40" tempmax="125" vccmin="1.8" vccmax="5.5"/>
  </variants>
  <devices>
    <device name="PIC32CM6408PL10064" architecture="CORTEX-M0PLUS" family="PIC32CMPL" series="PIC32CMPL10">
      <address-spaces>
        <address-space id="base" name="base" start="0" size="0x100000000" endianness="little">
          <memory-segment name="BROM" start="0x00000000" size="0x8000" type="rom" rw="R" exec="true"/>
          <memory-segment name="FLASH" start="0x0C000000" size="0x10000" type="flash" pagesize="512" rw="RW" exec="true"/>
          <memory-segment name="BOOTCFG" start="0x0D000400" size="0x100" type="fuses" rw="R"/>
          <memory-segment name="SIGNATURE" start="0x0D000200" size="0x100" type="fuses" rw="R"/>
          <memory-segment name="HSRAM" start="0x20000000" size="0x2000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="APBA" start="0x40000000" size="0x4000" type="io" rw="RW"/>
          <memory-segment name="APBB" start="0x41000000" size="0x10000" type="io" rw="RW"/>
          <memory-segment name="APBC" start="0x42000000" size="0x8000" type="io" rw="RW"/>
          <memory-segment name="IOBUS" start="0x50000000" size="0x200" type="io" rw="RW"/>
          <memory-segment name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW"/>
        </address-space>
        <address-space id="fuses" name="fuses" start="0x00000000" size="0x20000000" endianness="little"/>
      </address-spaces>
      <parameters>
        <param name="__CM0PLUS_REV" value="0x0001" caption="Cortex-M0+ Core Revision"/>
        <param name="__MPU_PRESENT" value="0" caption="MPU present or not"/>
        <param name="__NVIC_PRIO_BITS" value="2" caption="Number of Bits used for Priority Levels"/>
        <param name="__VTOR_PRESENT" value="1" caption="Vector Table Offset Register present or not"/>
        <param name="__Vendor_SysTickConfig" value="0" caption="Set to 1 if different SysTick Config is used"/>
      </parameters>
      <peripherals>
        <module name="AC" id="06254" name2="cmp_ctrl_arm_v1" version="v1">
          <instance name="AC">
            <register-group name="AC" name-in-module="AC" address-space="base" offset="0x42002000"/>
            <signals>
              <signal group="AC0N" index="0" function="B" pad="PA19"/>
              <signal group="AC0N" index="1" function="B" pad="PA16"/>
              <signal group="AC0N" index="2" function="B" pad="PA23"/>
              <signal group="AC0P" index="0" function="B" pad="PA18"/>
              <signal group="AC0P" index="1" function="B" pad="PB08"/>
              <signal group="AC0P" index="2" function="B" pad="PB10"/>
              <signal group="AC0P" index="3" function="B" pad="PA22"/>
              <signal group="AC0P" index="5" function="B" pad="PA20"/>
              <signal group="AC0P" index="6" function="B" pad="PA21"/>
              <signal group="AC1N" index="0" function="B" pad="PA21"/>
              <signal group="AC1N" index="1" function="B" pad="PA16"/>
              <signal group="AC1N" index="2" function="B" pad="PA23"/>
              <signal group="AC1P" index="0" function="B" pad="PA18"/>
              <signal group="AC1P" index="1" function="B" pad="PA19"/>
              <signal group="AC1P" index="2" function="B" pad="PA20"/>
              <signal group="AC1P" index="3" function="B" pad="PA22"/>
              <signal group="AC1P" index="5" function="B" pad="PA21"/>
              <signal group="CMP" index="0" function="H" pad="PA07"/>
              <signal group="CMP" index="0" function="H" pad="PA15"/>
              <signal group="CMP" index="1" function="H" pad="PA05"/>
              <signal group="CMP" index="1" function="H" pad="PA13"/>
            </signals>
            <parameters>
              <param name="NUM_CMP" value="2" caption="Number of comparators"/>
              <param name="PAIRS" value="1" caption="Number of pairs of comparators"/>
              <param name="INSTANCE_ID" value="72" caption="Instance index for AC"/>
            </parameters>
          </instance>
        </module>
        <module name="ADC" id="06272" name2="adc_12b_diff_ctrl_arm_v1" version="v1">
          <instance name="ADC0">
            <register-group name="ADC0" name-in-module="ADC" address-space="base" offset="0x42001C00"/>
            <signals>
              <signal group="AIN" index="2" function="B" pad="PA02"/>
              <signal group="AIN" index="3" function="B" pad="PA03"/>
              <signal group="AIN" index="4" function="B" pad="PA04"/>
              <signal group="AIN" index="5" function="B" pad="PA05"/>
              <signal group="AIN" index="6" function="B" pad="PA06"/>
              <signal group="AIN" index="7" function="B" pad="PA07"/>
              <signal group="AIN" index="16" function="B" pad="PA16"/>
              <signal group="AIN" index="17" function="B" pad="PA17"/>
              <signal group="AIN" index="18" function="B" pad="PA18"/>
              <signal group="AIN" index="19" function="B" pad="PA19"/>
              <signal group="AIN" index="20" function="B" pad="PA20"/>
              <signal group="AIN" index="21" function="B" pad="PA21"/>
              <signal group="AIN" index="22" function="B" pad="PA22"/>
              <signal group="AIN" index="23" function="B" pad="PA23"/>
              <signal group="AIN" index="24" function="B" pad="PA24"/>
              <signal group="AIN" index="25" function="B" pad="PA25"/>
              <signal group="AIN" index="26" function="B" pad="PA26"/>
              <signal group="AIN" index="27" function="B" pad="PA27"/>
              <signal group="AIN" index="28" function="B" pad="PA28"/>
              <signal group="AIN" index="29" function="B" pad="PA29"/>
              <signal group="AIN" index="31" function="B" pad="PA31"/>
              <signal group="AIN" index="40" function="B" pad="PB08"/>
              <signal group="AIN" index="41" function="B" pad="PB09"/>
              <signal group="AIN" index="42" function="B" pad="PB10"/>
              <signal group="AIN" index="43" function="B" pad="PB11"/>
              <signal group="AIN" index="44" function="B" pad="PB12"/>
              <signal group="AIN" index="45" function="B" pad="PB13"/>
              <signal group="AIN" index="46" function="B" pad="PB14"/>
              <signal group="AIN" index="47" function="B" pad="PB15"/>
              <signal group="VREFP" function="B" pad="PA23"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RESRDY" value="19" caption="Index of DMA RESRDY trigger"/>
              <param name="DMAC_ID_SAMPRDY" value="20" caption="Index of DMA SAMPRDY trigger"/>
              <param name="INSTANCE_ID" value="71" caption="Instance index for ADC0"/>
            </parameters>
          </instance>
        </module>
        <module name="CCL" id="05277" name2="cla_ccl_apb_v1" version="v1">
          <instance name="CCL">
            <register-group name="CCL" name-in-module="CCL" address-space="base" offset="0x42002400"/>
            <signals>
              <signal group="IN" index="0" function="H" pad="PA00"/>
              <signal group="IN" index="1" function="H" pad="PA01"/>
              <signal group="IN" index="2" function="H" pad="PA02"/>
              <signal group="IN" index="3" function="H" pad="PA08"/>
              <signal group="IN" index="4" function="H" pad="PA09"/>
              <signal group="IN" index="5" function="H" pad="PA10"/>
              <signal group="IN" index="6" function="H" pad="PA16"/>
              <signal group="IN" index="7" function="H" pad="PA17"/>
              <signal group="IN" index="8" function="H" pad="PA18"/>
              <signal group="IN" index="9" function="H" pad="PA24"/>
              <signal group="IN" index="10" function="H" pad="PA25"/>
              <signal group="IN" index="11" function="H" pad="PA26"/>
              <signal group="OUT" index="0" function="H" pad="PA03"/>
              <signal group="OUT" index="0" function="H" pad="PA06"/>
              <signal group="OUT" index="1" function="H" pad="PA11"/>
              <signal group="OUT" index="1" function="H" pad="PA14"/>
              <signal group="OUT" index="2" function="H" pad="PA19"/>
              <signal group="OUT" index="2" function="H" pad="PA22"/>
              <signal group="OUT" index="3" function="H" pad="PA27"/>
            </signals>
            <parameters>
              <param name="CCL_WPCTRL_KEY" value="0x43434C" caption="&quot;CCL&quot; in ASCII, key used to access Write Protection Register"/>
              <param name="GCLK_ID" value="12" caption="GCLK index for CCL"/>
              <param name="IO_NUM" value="12" caption="Numer of input pins"/>
              <param name="LUT_NUM" value="4" caption="Number of LUT in a CCL"/>
              <param name="SEQ_NUM" value="2" caption="Number of SEQ in a CCL"/>
              <param name="INSTANCE_ID" value="73" caption="Instance index for CCL"/>
            </parameters>
          </instance>
        </module>
