zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10064.atdf
        <module name="OSCCTRL" id="06250" name2="osc_ctrl_arm_v1" version="v1">
          <instance name="OSCCTRL">
            <register-group name="OSCCTRL" name-in-module="OSCCTRL" address-space="base" offset="0x40001000"/>
            <parameters>
              <param name="INSTANCE_ID" value="4" caption="Instance index for OSCCTRL"/>
            </parameters>
          </instance>
        </module>
        <module name="PAC" id="U2120" name2="U2120" version="v1">
          <instance name="PAC">
            <register-group name="PAC" name-in-module="PAC" address-space="base" offset="0x40000000"/>
            <parameters>
              <param name="HPB_NUM" value="3" caption="Number of bridges AHB/APB"/>
              <param name="INTFLAG_NUM" value="4" caption="Number of intflag registers"/>
              <param name="INSTANCE_ID" value="0" caption="Instance index for PAC"/>
            </parameters>
          </instance>
        </module>
        <module name="PM" id="06258" name2="pwr_pm_arm_v1" version="v1">
          <instance name="PM">
            <register-group name="PM" name-in-module="PM" address-space="base" offset="0x40000400"/>
            <parameters>
              <param name="INSTANCE_ID" value="1" caption="Instance index for PM"/>
            </parameters>
          </instance>
        </module>
        <module name="PORT" id="U2210" name2="U2210" version="v1">
          <instance name="PORT">
            <register-group name="PORT" name-in-module="PORT" address-space="base" offset="0x41000000"/>
            <register-group name="PORT_IOBUS" name-in-module="PORT" address-space="base" offset="0x50000000"/>
            <signals>
              <signal group="P" index="0" function="default" pad="PA00"/>
              <signal group="P" index="1" function="default" pad="PA01"/>
              <signal group="P" index="2" function="default" pad="PA02"/>
              <signal group="P" index="3" function="default" pad="PA03"/>
              <signal group="P" index="4" function="default" pad="PA04"/>
              <signal group="P" index="5" function="default" pad="PA05"/>
              <signal group="P" index="6" function="default" pad="PA06"/>
              <signal group="P" index="7" function="default" pad="PA07"/>
              <signal group="P" index="8" function="default" pad="PA08"/>
              <signal group="P" index="9" function="default" pad="PA09"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="12" function="default" pad="PA12"/>
              <signal group="P" index="13" function="default" pad="PA13"/>
              <signal group="P" index="14" function="default" pad="PA14"/>
              <signal group="P" index="15" function="default" pad="PA15"/>
              <signal group="P" index="16" function="default" pad="PA16"/>
              <signal group="P" index="17" function="default" pad="PA17"/>
              <signal group="P" index="18" function="default" pad="PA18"/>
              <signal group="P" index="19" function="default" pad="PA19"/>
              <signal group="P" index="20" function="default" pad="PA20"/>
              <signal group="P" index="21" function="default" pad="PA21"/>
              <signal group="P" index="22" function="default" pad="PA22"/>
              <signal group="P" index="23" function="default" pad="PA23"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
              <signal group="P" index="25" function="default" pad="PA25"/>
              <signal group="P" index="26" function="default" pad="PA26"/>
              <signal group="P" index="27" function="default" pad="PA27"/>
              <signal group="P" index="28" function="default" pad="PA28"/>
              <signal group="P" index="29" function="default" pad="PA29"/>
              <signal group="P" index="30" function="default" pad="PA30"/>
              <signal group="P" index="31" function="default" pad="PA31"/>
              <signal group="P" index="32" function="default" pad="PB00"/>
              <signal group="P" index="33" function="default" pad="PB01"/>
              <signal group="P" index="34" function="default" pad="PB02"/>
              <signal group="P" index="35" function="default" pad="PB03"/>
              <signal group="P" index="36" function="default" pad="PB04"/>
              <signal group="P" index="37" function="default" pad="PB05"/>
              <signal group="P" index="38" function="default" pad="PB06"/>
              <signal group="P" index="39" function="default" pad="PB07"/>
              <signal group="P" index="40" function="default" pad="PB08"/>
              <signal group="P" index="41" function="default" pad="PB09"/>
              <signal group="P" index="42" function="default" pad="PB10"/>
              <signal group="P" index="43" function="default" pad="PB11"/>
              <signal group="P" index="44" function="default" pad="PB12"/>
              <signal group="P" index="45" function="default" pad="PB13"/>
              <signal group="P" index="46" function="default" pad="PB14"/>
              <signal group="P" index="47" function="default" pad="PB15"/>
              <signal group="P" index="48" function="default" pad="PB16"/>
              <signal group="P" index="49" function="default" pad="PB17"/>
              <signal group="P" index="50" function="default" pad="PB18"/>
              <signal group="P" index="51" function="default" pad="PB19"/>
              <signal group="P" index="52" function="default" pad="PB20"/>
              <signal group="P" index="53" function="default" pad="PB21"/>
              <signal group="P" index="54" function="default" pad="PB22"/>
              <signal group="P" index="55" function="default" pad="PB23"/>
            </signals>
            <parameters>
              <param name="BITS" value="56"/>
              <param name="DIR_DEFAULT_VAL" value="0x00000000 0x00000000"/>
              <param name="DIR_IMPLEMENTED" value="0xBFFFFFFF 0x00FFFFFF"/>
              <param name="DRVSTR" value="0" caption="DRVSTR supported?"/>
              <param name="DRVSTR_DEFAULT_VAL" value="0x00000000 0x00000000"/>
              <param name="DRVSTR_IMPLEMENTED" value="0x00000000 0x00000000"/>
              <param name="EVENT_IMPLEMENTED" value="0xFFFFFFFF 0x00FFFFFF"/>
              <param name="EV_NUM" value="4"/>
              <param name="GROUPS" value="2"/>
              <param name="INEN_DEFAULT_VAL" value="0x00000000 0x00000000"/>
              <param name="INEN_IMPLEMENTED" value="0xFFFFFFFF 0x00FFFFFF"/>
              <param name="ODRAIN" value="0" caption="ODRAIN supported?"/>
              <param name="ODRAIN_DEFAULT_VAL" value="0x00000000 0x00000000"/>
              <param name="ODRAIN_IMPLEMENTED" value="0x00000000 0x00000000"/>
              <param name="OUT_DEFAULT_VAL" value="0x00000000 0x00000000"/>
              <param name="OUT_IMPLEMENTED" value="0xBFFFFFFF 0x00FFFFFF"/>
              <param name="PIN_IMPLEMENTED" value="0xFFFFFFFF 0x00FFFFFF"/>
              <param name="PMUXBIT0_DEFAULT_VAL" value="0x00000000 0x00000000"/>
              <param name="PMUXBIT0_IMPLEMENTED" value="0xBFFFEFFF 0x000FFF0F"/>
              <param name="PMUXBIT1_DEFAULT_VAL" value="0x80000000 0x00000000"/>
              <param name="PMUXBIT1_IMPLEMENTED" value="0xBFFFFFFF 0x0000FF0F"/>
              <param name="PMUXBIT2_DEFAULT_VAL" value="0x80000000 0x00000000"/>
              <param name="PMUXBIT2_IMPLEMENTED" value="0xBFFFEFFF 0x003FFF0F"/>
              <param name="PMUXBIT3_DEFAULT_VAL" value="0x00000000 0x00000000"/>
              <param name="PMUXBIT3_IMPLEMENTED" value="0xBFFF0FFF 0x0000FF00"/>
              <param name="PMUXEN_DEFAULT_VAL" value="0x80000000 0x00000000"/>
              <param name="PMUXEN_IMPLEMENTED" value="0xFFFFFFFF 0x00FFFFFF"/>
              <param name="PULLEN_DEFAULT_VAL" value="0x00000000 0x00000000"/>
              <param name="PULLEN_IMPLEMENTED" value="0xFFFFFFFF 0x00FFFFFF"/>
              <param name="SLEWLIM" value="1" caption="SLEWLIM supported?"/>
              <param name="SLEWLIM_DEFAULT_VAL" value="0x00000000 0x00000000"/>
              <param name="SLEWLIM_IMPLEMENTED" value="0xBFFFFFFF 0x00FFFFFF"/>
              <param name="INSTANCE_ID" value="32" caption="Instance index for PORT"/>
            </parameters>
          </instance>
        </module>
        <module name="PTC" id="06273" name2="afe_ptc_ctrl_arm_v1" version="1.a.0">
          <instance name="PTC">
            <signals>
              <signal group="PAD" index="2" function="P" pad="PA02"/>
              <signal group="PAD" index="3" function="P" pad="PA03"/>
              <signal group="PAD" index="4" function="P" pad="PA04"/>
              <signal group="PAD" index="5" function="P" pad="PA05"/>
              <signal group="PAD" index="6" function="P" pad="PA06"/>
              <signal group="PAD" index="7" function="P" pad="PA07"/>
              <signal group="PAD" index="16" function="P" pad="PA16"/>
              <signal group="PAD" index="17" function="P" pad="PA17"/>
              <signal group="PAD" index="18" function="P" pad="PA18"/>
              <signal group="PAD" index="19" function="P" pad="PA19"/>
              <signal group="PAD" index="20" function="P" pad="PA20"/>
              <signal group="PAD" index="21" function="P" pad="PA21"/>
              <signal group="PAD" index="22" function="P" pad="PA22"/>
              <signal group="PAD" index="23" function="P" pad="PA23"/>
              <signal group="PAD" index="24" function="P" pad="PA24"/>
              <signal group="PAD" index="25" function="P" pad="PA25"/>
              <signal group="PAD" index="26" function="P" pad="PA26"/>
              <signal group="PAD" index="27" function="P" pad="PA27"/>
              <signal group="PAD" index="28" function="P" pad="PA28"/>
              <signal group="PAD" index="29" function="P" pad="PA29"/>
              <signal group="PAD" index="31" function="P" pad="PA31"/>
              <signal group="PAD" index="40" function="P" pad="PB08"/>
              <signal group="PAD" index="41" function="P" pad="PB09"/>
              <signal group="PAD" index="42" function="P" pad="PB10"/>
              <signal group="PAD" index="43" function="P" pad="PB11"/>
              <signal group="PAD" index="44" function="P" pad="PB12"/>
              <signal group="PAD" index="45" function="P" pad="PB13"/>
              <signal group="PAD" index="46" function="P" pad="PB14"/>
              <signal group="PAD" index="47" function="P" pad="PB15"/>
              <signal group="PTC_EXTCINT" function="B" pad="PA21"/>
              <signal group="PTC_EXTCINT" index="1" function="B" pad="PA22"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="74" caption="Instance index for PTC"/>
            </parameters>
          </instance>
        </module>
