zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10064.atdf
        <module name="RSTC" id="06259" name2="rst_ctrl_arm_v1" version="v1">
          <instance name="RSTC">
            <register-group name="RSTC" name-in-module="RSTC" address-space="base" offset="0x40000C00"/>
            <parameters>
              <param name="INSTANCE_ID" value="3" caption="Instance index for RSTC"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="U2250" name2="U2250" version="v1">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x40002400"/>
            <parameters>
              <param name="ALARM_NUM" value="1" caption="Number of Alarms"/>
              <param name="COMP16_NUM" value="2" caption="Number of 16-bit Comparators"/>
              <param name="COMP32_NUM" value="1" caption="Number of 32-bit Comparators"/>
              <param name="GPR_NUM" value="0" caption="Number of General-Purpose Registers"/>
              <param name="PER_NUM" value="8" caption="Number of Periodic Intervals"/>
              <param name="INSTANCE_ID" value="9" caption="Instance index for RTC"/>
            </parameters>
          </instance>
        </module>
        <module name="SERCOM" id="U2201" name2="U2201" version="v1">
          <instance name="SERCOM0">
            <register-group name="SERCOM0" name-in-module="SERCOM" address-space="base" offset="0x42000400"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA10"/>
              <signal group="PAD" index="0" function="C" pad="PA00"/>
              <signal group="PAD" index="0" function="C" pad="PA04"/>
              <signal group="PAD" index="1" function="D" pad="PA11"/>
              <signal group="PAD" index="1" function="C" pad="PA01"/>
              <signal group="PAD" index="1" function="C" pad="PA05"/>
              <signal group="PAD" index="2" function="D" pad="PA08"/>
              <signal group="PAD" index="2" function="D" pad="PA31"/>
              <signal group="PAD" index="2" function="C" pad="PA02"/>
              <signal group="PAD" index="2" function="C" pad="PA06"/>
              <signal group="PAD" index="3" function="D" pad="PA09"/>
              <signal group="PAD" index="3" function="C" pad="PA03"/>
              <signal group="PAD" index="3" function="C" pad="PA07"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="1" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="2" caption="Index of DMA TX trigger"/>
              <param name="GCLK_ID_CORE" value="6"/>
              <param name="GCLK_ID_SLOW" value="5"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="INSTANCE_ID" value="65" caption="Instance index for SERCOM0"/>
            </parameters>
          </instance>
          <instance name="SERCOM1">
            <register-group name="SERCOM1" name-in-module="SERCOM" address-space="base" offset="0x42000800"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA00"/>
              <signal group="PAD" index="0" function="D" pad="PA26"/>
              <signal group="PAD" index="0" function="D" pad="PB00"/>
              <signal group="PAD" index="0" function="C" pad="PA10"/>
              <signal group="PAD" index="0" function="C" pad="PA14"/>
              <signal group="PAD" index="0" function="C" pad="PA20"/>
              <signal group="PAD" index="0" function="C" pad="PA31"/>
              <signal group="PAD" index="1" function="D" pad="PA01"/>
              <signal group="PAD" index="1" function="D" pad="PA27"/>
              <signal group="PAD" index="1" function="D" pad="PB01"/>
              <signal group="PAD" index="1" function="C" pad="PA11"/>
              <signal group="PAD" index="1" function="C" pad="PA15"/>
              <signal group="PAD" index="2" function="D" pad="PA02"/>
              <signal group="PAD" index="2" function="D" pad="PA24"/>
              <signal group="PAD" index="2" function="D" pad="PB02"/>
              <signal group="PAD" index="2" function="C" pad="PA08"/>
              <signal group="PAD" index="2" function="C" pad="PA12"/>
              <signal group="PAD" index="2" function="C" pad="PA22"/>
              <signal group="PAD" index="3" function="D" pad="PA03"/>
              <signal group="PAD" index="3" function="D" pad="PA25"/>
              <signal group="PAD" index="3" function="D" pad="PB03"/>
              <signal group="PAD" index="3" function="C" pad="PA09"/>
              <signal group="PAD" index="3" function="C" pad="PA13"/>
              <signal group="PAD" index="3" function="C" pad="PA23"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="3" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="4" caption="Index of DMA TX trigger"/>
              <param name="GCLK_ID_CORE" value="8"/>
              <param name="GCLK_ID_SLOW" value="7"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="INSTANCE_ID" value="66" caption="Instance index for SERCOM1"/>
            </parameters>
          </instance>
        </module>
        <module name="SUPC" id="06257" name2="pwr_supc_340k_arm_v1" version="v1">
          <instance name="SUPC">
            <register-group name="SUPC" name-in-module="SUPC" address-space="base" offset="0x40001800"/>
            <parameters>
              <param name="INSTANCE_ID" value="6" caption="Instance index for SUPC"/>
            </parameters>
          </instance>
        </module>
        <module name="SYSCTRL" id="06261" name2="cfg_sysctrl_arm_v1" version="v1-rc12">
          <instance name="SYSCTRL">
            <register-group name="SYSCTRL" name-in-module="SYSCTRL" address-space="base" offset="0x42002C00"/>
            <signals>
              <signal group="ATWI" function="ATWI_ALT3" pad="PA21"/>
              <signal group="ATWI" function="ATWI_ALT2" pad="PA23"/>
              <signal group="ATWI" function="ATWI_ALT1" pad="PA22"/>
              <signal group="ATWO" function="ATWO_ALT3" pad="PA23"/>
              <signal group="ATWO" function="ATWO_ALT2" pad="PA22"/>
              <signal group="ATWO" function="ATWO_ALT1" pad="PA21"/>
              <signal group="DTWROUTE" index="0" function="DTW0_ALT4" pad="PA04"/>
              <signal group="DTWROUTE" index="0" function="DTW0_ALT3" pad="PA08"/>
              <signal group="DTWROUTE" index="0" function="DTW0_ALT2" pad="PA30"/>
              <signal group="DTWROUTE" index="0" function="DTW0_ALT1" pad="PA20"/>
              <signal group="DTWROUTE" index="1" function="DTW1_ALT4" pad="PA05"/>
              <signal group="DTWROUTE" index="1" function="DTW1_ALT3" pad="PA09"/>
              <signal group="DTWROUTE" index="1" function="DTW1_ALT2" pad="PA31"/>
              <signal group="DTWROUTE" index="1" function="DTW1_ALT1" pad="PA21"/>
              <signal group="DTWROUTE" index="2" function="DTW2_ALT4" pad="PA06"/>
              <signal group="DTWROUTE" index="2" function="DTW2_ALT3" pad="PA10"/>
              <signal group="DTWROUTE" index="2" function="DTW2_ALT2" pad="PA00"/>
              <signal group="DTWROUTE" index="2" function="DTW2_ALT1" pad="PA22"/>
              <signal group="DTWROUTE" index="3" function="DTW3_ALT4" pad="PA07"/>
              <signal group="DTWROUTE" index="3" function="DTW3_ALT3" pad="PA11"/>
              <signal group="DTWROUTE" index="3" function="DTW3_ALT2" pad="PA01"/>
              <signal group="DTWROUTE" index="3" function="DTW3_ALT1" pad="PA23"/>
              <signal group="ICELL0" function="ICELL0_ALT1" pad="PA20"/>
              <signal group="ICELL1" index="1" function="ICELL1_ALT1" pad="PA21"/>
              <signal group="PULLDIS" function="PULLDIS" pad="PA30"/>
              <signal group="TBUF" function="TBUF_ALT" pad="PA21"/>
              <signal group="TBUF" function="TBUF" pad="PA22"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="75" caption="Instance index for SYSCTRL"/>
            </parameters>
          </instance>
        </module>
        <module name="SysTick" id="SYSTEM_IP" version="1.0.0">
          <instance name="SysTick">
            <register-group name="SysTick" name-in-module="SysTick" address-space="base" offset="0xE000E010"/>
