zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10064.atdf
        <register name="STATUSC" offset="0x3C" rw="R" size="4" initval="0x00000000" caption="Peripheral Write Protection Status C">
          <bitfield name="EVSYS_" caption="EVSYS APB Protect Enable" mask="0x1"/>
          <bitfield name="SERCOM0_" caption="SERCOM0 APB Protect Enable" mask="0x2"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 APB Protect Enable" mask="0x4"/>
          <bitfield name="TC0_" caption="TC0 APB Protect Enable" mask="0x8"/>
          <bitfield name="TC1_" caption="TC1 APB Protect Enable" mask="0x10"/>
          <bitfield name="TC2_" caption="TC2 APB Protect Enable" mask="0x20"/>
          <bitfield name="TCC0_" caption="TCC0 APB Protect Enable" mask="0x40"/>
          <bitfield name="ADC0_" caption="ADC0 APB Protect Enable" mask="0x80"/>
          <bitfield name="AC_" caption="AC APB Protect Enable" mask="0x100"/>
          <bitfield name="CCL_" caption="CCL APB Protect Enable" mask="0x200"/>
          <bitfield name="PTC_" caption="PTC APB Protect Enable" mask="0x400"/>
          <bitfield name="SYSCTRL_" caption="SYSCTRL APB Protect Enable" mask="0x800"/>
        </register>
      </register-group>
      <value-group name="PAC_WRCTRL__PERID">
        <value name="PAC" caption="APBA Peripheral" value="0x00"/>
        <value name="PM" caption="APBA Peripheral" value="0x01"/>
        <value name="MCLK" caption="APBA Peripheral" value="0x02"/>
        <value name="RSTC" caption="APBA Peripheral" value="0x03"/>
        <value name="OSCCTRL" caption="APBA Peripheral" value="0x04"/>
        <value name="OSC32KCTRL" caption="APBA Peripheral" value="0x05"/>
        <value name="SUPC" caption="APBA Peripheral" value="0x06"/>
        <value name="GCLK" caption="APBA Peripheral" value="0x07"/>
        <value name="WDT" caption="APBA Peripheral" value="0x08"/>
        <value name="RTC" caption="APBA Peripheral" value="0x09"/>
        <value name="EIC" caption="APBA Peripheral" value="0x0A"/>
        <value name="PORT" caption="APBB Peripheral" value="0x20"/>
        <value name="DSU" caption="APBB Peripheral" value="0x21"/>
        <value name="NVMCTRL" caption="APBB Peripheral" value="0x22"/>
        <value name="DMAC" caption="APBB Peripheral" value="0x23"/>
        <value name="MTB" caption="APBB Peripheral" value="0x24"/>
        <value name="HMATRIXHS" caption="APBB Peripheral" value="0x25"/>
        <value name="EVSYS" caption="APBC Peripheral" value="0x40"/>
        <value name="SERCOM0" caption="APBC Peripheral" value="0x41"/>
        <value name="SERCOM1" caption="APBC Peripheral" value="0x42"/>
        <value name="TC0" caption="APBC Peripheral" value="0x43"/>
        <value name="TC1" caption="APBC Peripheral" value="0x44"/>
        <value name="TC2" caption="APBC Peripheral" value="0x45"/>
        <value name="TCC0" caption="APBC Peripheral" value="0x46"/>
        <value name="ADC0" caption="APBC Peripheral" value="0x47"/>
        <value name="AC" caption="APBC Peripheral" value="0x48"/>
        <value name="CCL" caption="APBC Peripheral" value="0x49"/>
        <value name="PTC" caption="APBC Peripheral" value="0x4A"/>
        <value name="SYSCTRL" caption="APBC Peripheral" value="0x4B"/>
      </value-group>
      <value-group name="PAC_WRCTRL__KEY">
        <value name="OFF" caption="No action" value="0x0"/>
        <value name="CLR" caption="Clear the peripheral write-control" value="0x1"/>
        <value name="SET" caption="Set the peripheral write-control" value="0x2"/>
        <value name="SETLCK" caption="Set and lock the peripheral write-control until the next hardware reset" value="0x3"/>
      </value-group>
    </module>
    <module name="PM" id="06258" name2="pwr_pm_arm_v1" version="v1" caption="Power Manager">
      <register-group name="PM" caption="Power Manager">
        <register name="SLEEPCFG" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Sleep Configuration">
          <bitfield name="SLEEPMODE" caption="Sleep Mode" mask="0x7" values="PM_SLEEPCFG__SLEEPMODE"/>
        </register>
        <register name="WPCTRL" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Write Protection Control">
          <bitfield name="WPEN" caption="Write Protection Enable" mask="0x1"/>
          <bitfield name="WPLCK" caption="Write Protection Lock" mask="0x2"/>
          <bitfield name="WPKEY" caption="Write Protection Key" mask="0xFFFFFF00" values="PM_WPCTRL__WPKEY"/>
        </register>
      </register-group>
      <value-group name="PM_SLEEPCFG__SLEEPMODE">
        <value name="IDLE" caption="Idle sleep mode enabled" value="0x2"/>
        <value name="STANDBY" caption="Standby sleep mode enabled" value="0x4"/>
      </value-group>
      <value-group name="PM_WPCTRL__WPKEY">
        <value name="KEY" caption="Allow writes to the WPCTRL register" value="0x505752"/>
      </value-group>
    </module>
    <module name="PORT" id="U2210" name2="U2210" version="v1" caption="I/O Pin Controller">
      <register-group name="GROUP" size="0x80">
        <register name="DIR" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Data Direction">
          <bitfield name="DIR0" caption="Port Data Direction 0" mask="0x1"/>
          <bitfield name="DIR1" caption="Port Data Direction 1" mask="0x2"/>
          <bitfield name="DIR2" caption="Port Data Direction 2" mask="0x4"/>
          <bitfield name="DIR3" caption="Port Data Direction 3" mask="0x8"/>
          <bitfield name="DIR4" caption="Port Data Direction 4" mask="0x10"/>
          <bitfield name="DIR5" caption="Port Data Direction 5" mask="0x20"/>
          <bitfield name="DIR6" caption="Port Data Direction 6" mask="0x40"/>
          <bitfield name="DIR7" caption="Port Data Direction 7" mask="0x80"/>
          <bitfield name="DIR8" caption="Port Data Direction 8" mask="0x100"/>
          <bitfield name="DIR9" caption="Port Data Direction 9" mask="0x200"/>
          <bitfield name="DIR10" caption="Port Data Direction 10" mask="0x400"/>
          <bitfield name="DIR11" caption="Port Data Direction 11" mask="0x800"/>
          <bitfield name="DIR12" caption="Port Data Direction 12" mask="0x1000"/>
          <bitfield name="DIR13" caption="Port Data Direction 13" mask="0x2000"/>
          <bitfield name="DIR14" caption="Port Data Direction 14" mask="0x4000"/>
          <bitfield name="DIR15" caption="Port Data Direction 15" mask="0x8000"/>
          <bitfield name="DIR16" caption="Port Data Direction 16" mask="0x10000"/>
          <bitfield name="DIR17" caption="Port Data Direction 17" mask="0x20000"/>
          <bitfield name="DIR18" caption="Port Data Direction 18" mask="0x40000"/>
          <bitfield name="DIR19" caption="Port Data Direction 19" mask="0x80000"/>
          <bitfield name="DIR20" caption="Port Data Direction 20" mask="0x100000"/>
          <bitfield name="DIR21" caption="Port Data Direction 21" mask="0x200000"/>
          <bitfield name="DIR22" caption="Port Data Direction 22" mask="0x400000"/>
          <bitfield name="DIR23" caption="Port Data Direction 23" mask="0x800000"/>
          <bitfield name="DIR24" caption="Port Data Direction 24" mask="0x1000000"/>
          <bitfield name="DIR25" caption="Port Data Direction 25" mask="0x2000000"/>
          <bitfield name="DIR26" caption="Port Data Direction 26" mask="0x4000000"/>
          <bitfield name="DIR27" caption="Port Data Direction 27" mask="0x8000000"/>
          <bitfield name="DIR28" caption="Port Data Direction 28" mask="0x10000000"/>
          <bitfield name="DIR29" caption="Port Data Direction 29" mask="0x20000000"/>
          <bitfield name="DIR30" caption="Port Data Direction 30" mask="0x40000000"/>
          <bitfield name="DIR31" caption="Port Data Direction 31" mask="0x80000000"/>
        </register>
        <register name="DIRCLR" offset="0x4" rw="RW" size="4" atomic-op="clear:DIR" initval="0x00000000" caption="Data Direction Clear">
          <bitfield name="DIR0CLR" caption="Port Data Direction 0 Clear" mask="0x1"/>
          <bitfield name="DIR1CLR" caption="Port Data Direction 1 Clear" mask="0x2"/>
          <bitfield name="DIR2CLR" caption="Port Data Direction 2 Clear" mask="0x4"/>
          <bitfield name="DIR3CLR" caption="Port Data Direction 3 Clear" mask="0x8"/>
          <bitfield name="DIR4CLR" caption="Port Data Direction 4 Clear" mask="0x10"/>
          <bitfield name="DIR5CLR" caption="Port Data Direction 5 Clear" mask="0x20"/>
          <bitfield name="DIR6CLR" caption="Port Data Direction 6 Clear" mask="0x40"/>
          <bitfield name="DIR7CLR" caption="Port Data Direction 7 Clear" mask="0x80"/>
          <bitfield name="DIR8CLR" caption="Port Data Direction 8 Clear" mask="0x100"/>
          <bitfield name="DIR9CLR" caption="Port Data Direction 9 Clear" mask="0x200"/>
          <bitfield name="DIR10CLR" caption="Port Data Direction 10 Clear" mask="0x400"/>
          <bitfield name="DIR11CLR" caption="Port Data Direction 11 Clear" mask="0x800"/>
          <bitfield name="DIR12CLR" caption="Port Data Direction 12 Clear" mask="0x1000"/>
          <bitfield name="DIR13CLR" caption="Port Data Direction 13 Clear" mask="0x2000"/>
          <bitfield name="DIR14CLR" caption="Port Data Direction 14 Clear" mask="0x4000"/>
          <bitfield name="DIR15CLR" caption="Port Data Direction 15 Clear" mask="0x8000"/>
          <bitfield name="DIR16CLR" caption="Port Data Direction 16 Clear" mask="0x10000"/>
          <bitfield name="DIR17CLR" caption="Port Data Direction 17 Clear" mask="0x20000"/>
          <bitfield name="DIR18CLR" caption="Port Data Direction 18 Clear" mask="0x40000"/>
          <bitfield name="DIR19CLR" caption="Port Data Direction 19 Clear" mask="0x80000"/>
          <bitfield name="DIR20CLR" caption="Port Data Direction 20 Clear" mask="0x100000"/>
          <bitfield name="DIR21CLR" caption="Port Data Direction 21 Clear" mask="0x200000"/>
          <bitfield name="DIR22CLR" caption="Port Data Direction 22 Clear" mask="0x400000"/>
          <bitfield name="DIR23CLR" caption="Port Data Direction 23 Clear" mask="0x800000"/>
          <bitfield name="DIR24CLR" caption="Port Data Direction 24 Clear" mask="0x1000000"/>
          <bitfield name="DIR25CLR" caption="Port Data Direction 25 Clear" mask="0x2000000"/>
          <bitfield name="DIR26CLR" caption="Port Data Direction 26 Clear" mask="0x4000000"/>
          <bitfield name="DIR27CLR" caption="Port Data Direction 27 Clear" mask="0x8000000"/>
          <bitfield name="DIR28CLR" caption="Port Data Direction 28 Clear" mask="0x10000000"/>
          <bitfield name="DIR29CLR" caption="Port Data Direction 29 Clear" mask="0x20000000"/>
          <bitfield name="DIR30CLR" caption="Port Data Direction 30 Clear" mask="0x40000000"/>
          <bitfield name="DIR31CLR" caption="Port Data Direction 31 Clear" mask="0x80000000"/>
        </register>
        <register name="DIRSET" offset="0x8" rw="RW" size="4" atomic-op="set:DIR" initval="0x00000000" caption="Data Direction Set">
          <bitfield name="DIR0SET" caption="Port Data Direction 0 Set" mask="0x1"/>
          <bitfield name="DIR1SET" caption="Port Data Direction 1 Set" mask="0x2"/>
          <bitfield name="DIR2SET" caption="Port Data Direction 2 Set" mask="0x4"/>
          <bitfield name="DIR3SET" caption="Port Data Direction 3 Set" mask="0x8"/>
          <bitfield name="DIR4SET" caption="Port Data Direction 4 Set" mask="0x10"/>
          <bitfield name="DIR5SET" caption="Port Data Direction 5 Set" mask="0x20"/>
          <bitfield name="DIR6SET" caption="Port Data Direction 6 Set" mask="0x40"/>
          <bitfield name="DIR7SET" caption="Port Data Direction 7 Set" mask="0x80"/>
          <bitfield name="DIR8SET" caption="Port Data Direction 8 Set" mask="0x100"/>
          <bitfield name="DIR9SET" caption="Port Data Direction 9 Set" mask="0x200"/>
          <bitfield name="DIR10SET" caption="Port Data Direction 10 Set" mask="0x400"/>
          <bitfield name="DIR11SET" caption="Port Data Direction 11 Set" mask="0x800"/>
          <bitfield name="DIR12SET" caption="Port Data Direction 12 Set" mask="0x1000"/>
          <bitfield name="DIR13SET" caption="Port Data Direction 13 Set" mask="0x2000"/>
          <bitfield name="DIR14SET" caption="Port Data Direction 14 Set" mask="0x4000"/>
          <bitfield name="DIR15SET" caption="Port Data Direction 15 Set" mask="0x8000"/>
          <bitfield name="DIR16SET" caption="Port Data Direction 16 Set" mask="0x10000"/>
          <bitfield name="DIR17SET" caption="Port Data Direction 17 Set" mask="0x20000"/>
          <bitfield name="DIR18SET" caption="Port Data Direction 18 Set" mask="0x40000"/>
          <bitfield name="DIR19SET" caption="Port Data Direction 19 Set" mask="0x80000"/>
          <bitfield name="DIR20SET" caption="Port Data Direction 20 Set" mask="0x100000"/>
          <bitfield name="DIR21SET" caption="Port Data Direction 21 Set" mask="0x200000"/>
          <bitfield name="DIR22SET" caption="Port Data Direction 22 Set" mask="0x400000"/>
          <bitfield name="DIR23SET" caption="Port Data Direction 23 Set" mask="0x800000"/>
          <bitfield name="DIR24SET" caption="Port Data Direction 24 Set" mask="0x1000000"/>
          <bitfield name="DIR25SET" caption="Port Data Direction 25 Set" mask="0x2000000"/>
          <bitfield name="DIR26SET" caption="Port Data Direction 26 Set" mask="0x4000000"/>
          <bitfield name="DIR27SET" caption="Port Data Direction 27 Set" mask="0x8000000"/>
          <bitfield name="DIR28SET" caption="Port Data Direction 28 Set" mask="0x10000000"/>
          <bitfield name="DIR29SET" caption="Port Data Direction 29 Set" mask="0x20000000"/>
          <bitfield name="DIR30SET" caption="Port Data Direction 30 Set" mask="0x40000000"/>
          <bitfield name="DIR31SET" caption="Port Data Direction 31 Set" mask="0x80000000"/>
        </register>
        <register name="DIRTGL" offset="0xC" rw="RW" size="4" atomic-op="toggle:DIR" initval="0x00000000" caption="Data Direction Toggle">
          <bitfield name="DIR0TGL" caption="Port Data Direction 0 Toggle" mask="0x1"/>
          <bitfield name="DIR1TGL" caption="Port Data Direction 1 Toggle" mask="0x2"/>
          <bitfield name="DIR2TGL" caption="Port Data Direction 2 Toggle" mask="0x4"/>
          <bitfield name="DIR3TGL" caption="Port Data Direction 3 Toggle" mask="0x8"/>
          <bitfield name="DIR4TGL" caption="Port Data Direction 4 Toggle" mask="0x10"/>
          <bitfield name="DIR5TGL" caption="Port Data Direction 5 Toggle" mask="0x20"/>
          <bitfield name="DIR6TGL" caption="Port Data Direction 6 Toggle" mask="0x40"/>
          <bitfield name="DIR7TGL" caption="Port Data Direction 7 Toggle" mask="0x80"/>
          <bitfield name="DIR8TGL" caption="Port Data Direction 8 Toggle" mask="0x100"/>
          <bitfield name="DIR9TGL" caption="Port Data Direction 9 Toggle" mask="0x200"/>
          <bitfield name="DIR10TGL" caption="Port Data Direction 10 Toggle" mask="0x400"/>
          <bitfield name="DIR11TGL" caption="Port Data Direction 11 Toggle" mask="0x800"/>
          <bitfield name="DIR12TGL" caption="Port Data Direction 12 Toggle" mask="0x1000"/>
          <bitfield name="DIR13TGL" caption="Port Data Direction 13 Toggle" mask="0x2000"/>
          <bitfield name="DIR14TGL" caption="Port Data Direction 14 Toggle" mask="0x4000"/>
          <bitfield name="DIR15TGL" caption="Port Data Direction 15 Toggle" mask="0x8000"/>
          <bitfield name="DIR16TGL" caption="Port Data Direction 16 Toggle" mask="0x10000"/>
          <bitfield name="DIR17TGL" caption="Port Data Direction 17 Toggle" mask="0x20000"/>
          <bitfield name="DIR18TGL" caption="Port Data Direction 18 Toggle" mask="0x40000"/>
          <bitfield name="DIR19TGL" caption="Port Data Direction 19 Toggle" mask="0x80000"/>
          <bitfield name="DIR20TGL" caption="Port Data Direction 20 Toggle" mask="0x100000"/>
          <bitfield name="DIR21TGL" caption="Port Data Direction 21 Toggle" mask="0x200000"/>
          <bitfield name="DIR22TGL" caption="Port Data Direction 22 Toggle" mask="0x400000"/>
          <bitfield name="DIR23TGL" caption="Port Data Direction 23 Toggle" mask="0x800000"/>
          <bitfield name="DIR24TGL" caption="Port Data Direction 24 Toggle" mask="0x1000000"/>
          <bitfield name="DIR25TGL" caption="Port Data Direction 25 Toggle" mask="0x2000000"/>
          <bitfield name="DIR26TGL" caption="Port Data Direction 26 Toggle" mask="0x4000000"/>
          <bitfield name="DIR27TGL" caption="Port Data Direction 27 Toggle" mask="0x8000000"/>
          <bitfield name="DIR28TGL" caption="Port Data Direction 28 Toggle" mask="0x10000000"/>
          <bitfield name="DIR29TGL" caption="Port Data Direction 29 Toggle" mask="0x20000000"/>
          <bitfield name="DIR30TGL" caption="Port Data Direction 30 Toggle" mask="0x40000000"/>
          <bitfield name="DIR31TGL" caption="Port Data Direction 31 Toggle" mask="0x80000000"/>
        </register>
        <register name="OUT" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Data Output Value">
          <bitfield name="OUT0" caption="PORT Data Output Value 0" mask="0x1"/>
          <bitfield name="OUT1" caption="PORT Data Output Value 1" mask="0x2"/>
          <bitfield name="OUT2" caption="PORT Data Output Value 2" mask="0x4"/>
          <bitfield name="OUT3" caption="PORT Data Output Value 3" mask="0x8"/>
          <bitfield name="OUT4" caption="PORT Data Output Value 4" mask="0x10"/>
          <bitfield name="OUT5" caption="PORT Data Output Value 5" mask="0x20"/>
          <bitfield name="OUT6" caption="PORT Data Output Value 6" mask="0x40"/>
          <bitfield name="OUT7" caption="PORT Data Output Value 7" mask="0x80"/>
          <bitfield name="OUT8" caption="PORT Data Output Value 8" mask="0x100"/>
          <bitfield name="OUT9" caption="PORT Data Output Value 9" mask="0x200"/>
          <bitfield name="OUT10" caption="PORT Data Output Value 10" mask="0x400"/>
          <bitfield name="OUT11" caption="PORT Data Output Value 11" mask="0x800"/>
          <bitfield name="OUT12" caption="PORT Data Output Value 12" mask="0x1000"/>
          <bitfield name="OUT13" caption="PORT Data Output Value 13" mask="0x2000"/>
          <bitfield name="OUT14" caption="PORT Data Output Value 14" mask="0x4000"/>
          <bitfield name="OUT15" caption="PORT Data Output Value 15" mask="0x8000"/>
          <bitfield name="OUT16" caption="PORT Data Output Value 16" mask="0x10000"/>
          <bitfield name="OUT17" caption="PORT Data Output Value 17" mask="0x20000"/>
          <bitfield name="OUT18" caption="PORT Data Output Value 18" mask="0x40000"/>
          <bitfield name="OUT19" caption="PORT Data Output Value 19" mask="0x80000"/>
          <bitfield name="OUT20" caption="PORT Data Output Value 20" mask="0x100000"/>
          <bitfield name="OUT21" caption="PORT Data Output Value 21" mask="0x200000"/>
          <bitfield name="OUT22" caption="PORT Data Output Value 22" mask="0x400000"/>
          <bitfield name="OUT23" caption="PORT Data Output Value 23" mask="0x800000"/>
          <bitfield name="OUT24" caption="PORT Data Output Value 24" mask="0x1000000"/>
          <bitfield name="OUT25" caption="PORT Data Output Value 25" mask="0x2000000"/>
          <bitfield name="OUT26" caption="PORT Data Output Value 26" mask="0x4000000"/>
          <bitfield name="OUT27" caption="PORT Data Output Value 27" mask="0x8000000"/>
          <bitfield name="OUT28" caption="PORT Data Output Value 28" mask="0x10000000"/>
          <bitfield name="OUT29" caption="PORT Data Output Value 29" mask="0x20000000"/>
          <bitfield name="OUT30" caption="PORT Data Output Value 30" mask="0x40000000"/>
          <bitfield name="OUT31" caption="PORT Data Output Value 31" mask="0x80000000"/>
        </register>
        <register name="OUTCLR" offset="0x14" rw="RW" size="4" atomic-op="clear:OUT" initval="0x00000000" caption="Data Output Value Clear">
          <bitfield name="OUT0CLR" caption="PORT Data Output Value 0 Clear" mask="0x1"/>
          <bitfield name="OUT1CLR" caption="PORT Data Output Value 1 Clear" mask="0x2"/>
          <bitfield name="OUT2CLR" caption="PORT Data Output Value 2 Clear" mask="0x4"/>
          <bitfield name="OUT3CLR" caption="PORT Data Output Value 3 Clear" mask="0x8"/>
          <bitfield name="OUT4CLR" caption="PORT Data Output Value 4 Clear" mask="0x10"/>
          <bitfield name="OUT5CLR" caption="PORT Data Output Value 5 Clear" mask="0x20"/>
          <bitfield name="OUT6CLR" caption="PORT Data Output Value 6 Clear" mask="0x40"/>
          <bitfield name="OUT7CLR" caption="PORT Data Output Value 7 Clear" mask="0x80"/>
          <bitfield name="OUT8CLR" caption="PORT Data Output Value 8 Clear" mask="0x100"/>
          <bitfield name="OUT9CLR" caption="PORT Data Output Value 9 Clear" mask="0x200"/>
          <bitfield name="OUT10CLR" caption="PORT Data Output Value 10 Clear" mask="0x400"/>
          <bitfield name="OUT11CLR" caption="PORT Data Output Value 11 Clear" mask="0x800"/>
          <bitfield name="OUT12CLR" caption="PORT Data Output Value 12 Clear" mask="0x1000"/>
          <bitfield name="OUT13CLR" caption="PORT Data Output Value 13 Clear" mask="0x2000"/>
          <bitfield name="OUT14CLR" caption="PORT Data Output Value 14 Clear" mask="0x4000"/>
          <bitfield name="OUT15CLR" caption="PORT Data Output Value 15 Clear" mask="0x8000"/>
          <bitfield name="OUT16CLR" caption="PORT Data Output Value 16 Clear" mask="0x10000"/>
          <bitfield name="OUT17CLR" caption="PORT Data Output Value 17 Clear" mask="0x20000"/>
          <bitfield name="OUT18CLR" caption="PORT Data Output Value 18 Clear" mask="0x40000"/>
          <bitfield name="OUT19CLR" caption="PORT Data Output Value 19 Clear" mask="0x80000"/>
          <bitfield name="OUT20CLR" caption="PORT Data Output Value 20 Clear" mask="0x100000"/>
          <bitfield name="OUT21CLR" caption="PORT Data Output Value 21 Clear" mask="0x200000"/>
          <bitfield name="OUT22CLR" caption="PORT Data Output Value 22 Clear" mask="0x400000"/>
          <bitfield name="OUT23CLR" caption="PORT Data Output Value 23 Clear" mask="0x800000"/>
          <bitfield name="OUT24CLR" caption="PORT Data Output Value 24 Clear" mask="0x1000000"/>
          <bitfield name="OUT25CLR" caption="PORT Data Output Value 25 Clear" mask="0x2000000"/>
          <bitfield name="OUT26CLR" caption="PORT Data Output Value 26 Clear" mask="0x4000000"/>
          <bitfield name="OUT27CLR" caption="PORT Data Output Value 27 Clear" mask="0x8000000"/>
          <bitfield name="OUT28CLR" caption="PORT Data Output Value 28 Clear" mask="0x10000000"/>
          <bitfield name="OUT29CLR" caption="PORT Data Output Value 29 Clear" mask="0x20000000"/>
          <bitfield name="OUT30CLR" caption="PORT Data Output Value 30 Clear" mask="0x40000000"/>
          <bitfield name="OUT31CLR" caption="PORT Data Output Value 31 Clear" mask="0x80000000"/>
        </register>
