zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10064.atdf
        <register modes="USART" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="USART Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0x1C" values="SERCOM_USART_CTRLA__MODE"/>
          <bitfield name="RUNSTDBY" caption="Run In Standby" mask="0x80"/>
          <bitfield name="IBON" caption="Immediate Buffer Overflow Notification" mask="0x100"/>
          <bitfield name="SAMPR" caption="Sample Rate" mask="0xE000" values="SERCOM_USART_CTRLA__SAMPR"/>
          <bitfield name="TXPO" caption="Transmit Data Pinout" mask="0x30000" values="SERCOM_USART_CTRLA__TXPO"/>
          <bitfield name="RXPO" caption="Receive Data Pinout" mask="0x300000" values="SERCOM_USART_CTRLA__RXPO"/>
          <bitfield name="SAMPA" caption="Sample Adjustment" mask="0xC00000" values="SERCOM_USART_CTRLA__SAMPA"/>
          <bitfield name="FORM" caption="Frame Format" mask="0xF000000" values="SERCOM_USART_CTRLA__FORM"/>
          <bitfield name="CMODE" caption="Communication Mode" mask="0x10000000" values="SERCOM_USART_CTRLA__CMODE"/>
          <bitfield name="CPOL" caption="Clock Polarity" mask="0x20000000" values="SERCOM_USART_CTRLA__CPOL"/>
          <bitfield name="DORD" caption="Data Order" mask="0x40000000" values="SERCOM_USART_CTRLA__DORD"/>
        </register>
        <register modes="I2CM" name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="I2CM Control B">
          <bitfield name="SMEN" caption="Smart Mode Enable" mask="0x100"/>
          <bitfield name="QCEN" caption="Quick Command Enable" mask="0x200"/>
          <bitfield name="CMD" caption="Command" mask="0x30000"/>
          <bitfield name="ACKACT" caption="Acknowledge Action" mask="0x40000"/>
        </register>
        <register modes="I2CS" name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="I2CS Control B">
          <bitfield name="SMEN" caption="Smart Mode Enable" mask="0x100"/>
          <bitfield name="GCMD" caption="PMBus Group Command" mask="0x200"/>
          <bitfield name="AACKEN" caption="Automatic Acknowledge Enable" mask="0x400"/>
          <bitfield name="AMODE" caption="Address Mode" mask="0xC000" values="SERCOM_I2CS_CTRLB__AMODE"/>
          <bitfield name="CMD" caption="Command" mask="0x30000"/>
          <bitfield name="ACKACT" caption="Acknowledge Action" mask="0x40000"/>
        </register>
        <register modes="SPI" name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="SPI Control B">
          <bitfield name="CHSIZE" caption="Character Size" mask="0x7" values="SERCOM_SPI_CTRLB__CHSIZE"/>
          <bitfield name="PLOADEN" caption="Client Data Preload Enable" mask="0x40"/>
          <bitfield name="SSDE" caption="SPI Select Low Detect Enable" mask="0x200"/>
          <bitfield name="MSSEN" caption="Host SPI Select Enable" mask="0x2000"/>
          <bitfield name="AMODE" caption="Address Mode" mask="0xC000" values="SERCOM_SPI_CTRLB__AMODE"/>
          <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
        </register>
        <register modes="USART" name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="USART Control B">
          <bitfield name="CHSIZE" caption="Character Size" mask="0x7" values="SERCOM_USART_CTRLB__CHSIZE"/>
          <bitfield name="SBMODE" caption="Stop Bit Mode" mask="0x40" values="SERCOM_USART_CTRLB__SBMODE"/>
          <bitfield name="COLDEN" caption="Collision Detection Enable" mask="0x100"/>
          <bitfield name="SFDE" caption="Start of Frame Detection Enable" mask="0x200"/>
          <bitfield name="ENC" caption="Encoding Format" mask="0x400" values="SERCOM_USART_CTRLB__ENC"/>
          <bitfield name="PMODE" caption="Parity Mode" mask="0x2000" values="SERCOM_USART_CTRLB__PMODE"/>
          <bitfield name="TXEN" caption="Transmitter Enable" mask="0x10000"/>
          <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
          <bitfield name="LINCMD" caption="LIN Command" mask="0x3000000" values="SERCOM_USART_CTRLB__LINCMD"/>
        </register>
        <register modes="USART" name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="USART Control C">
          <bitfield name="GTIME" caption="Guard Time" mask="0x7"/>
          <bitfield name="BRKLEN" caption="LIN Host Break Length" mask="0x300" values="SERCOM_USART_CTRLC__BRKLEN"/>
          <bitfield name="HDRDLY" caption="LIN Host Header Delay" mask="0xC00" values="SERCOM_USART_CTRLC__HDRDLY"/>
        </register>
        <register modes="I2CM" name="BAUD" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="I2CM Baud Rate">
          <bitfield name="BAUD" caption="Host Baud Rate" mask="0xFF"/>
          <bitfield name="BAUDLOW" caption="Host Baud Rate Low" mask="0xFF00"/>
        </register>
        <register modes="SPI" name="BAUD" offset="0xC" rw="RW" size="1" initval="0x00" caption="SPI Baud Rate">
          <bitfield name="BAUD" caption="Baud Register" mask="0xFF"/>
        </register>
        <register modes="USART" name="BAUD" offset="0xC" rw="RW" size="2" initval="0x0000" caption="USART Baud">
          <mode name="ARITH" qualifier="SERCOM.CTRLA.SAMPR" value="0 2 4" caption="Arithmetic Mode"/>
          <mode name="FRAC" qualifier="SERCOM.CTRLA.SAMPR" value="1 3" caption="Fractional Mode"/>
          <bitfield modes="FRAC" name="BAUD" caption="Baud Value" mask="0x1FFF"/>
          <bitfield modes="FRAC" name="FP" caption="Fractional Part" mask="0xE000"/>
          <bitfield modes="ARITH" name="BAUD" caption="Baud Value" mask="0xFFFF"/>
        </register>
        <register modes="USART" name="RXPL" offset="0xE" rw="RW" size="1" initval="0x00" caption="USART Receive Pulse Length">
          <bitfield name="RXPL" caption="Receive Pulse Length" mask="0xFF"/>
        </register>
        <register modes="I2CM" name="INTENCLR" offset="0x14" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="I2CM Interrupt Enable Clear">
          <bitfield name="MB" caption="Host on Bus Interrupt Enable" mask="0x1"/>
          <bitfield name="SB" caption="Client on Bus Interrupt Enable" mask="0x2"/>
          <bitfield name="ERROR" caption="Error Interrupt Enable" mask="0x80"/>
        </register>
        <register modes="I2CS" name="INTENCLR" offset="0x14" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="I2CS Interrupt Enable Clear">
          <bitfield name="PREC" caption="Stop Received Interrupt Enable" mask="0x1"/>
          <bitfield name="AMATCH" caption="Address Match Interrupt Enable" mask="0x2"/>
          <bitfield name="DRDY" caption="Data Ready Interrupt Enable" mask="0x4"/>
          <bitfield name="ERROR" caption="Error Interrupt Enable" mask="0x80"/>
        </register>
        <register modes="SPI" name="INTENCLR" offset="0x14" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="SPI Interrupt Enable Clear">
          <bitfield name="DRE" caption="Data Register Empty Interrupt Enable" mask="0x1"/>
          <bitfield name="TXC" caption="Transmit Complete Interrupt Enable" mask="0x2"/>
          <bitfield name="RXC" caption="Receive Complete Interrupt Enable" mask="0x4"/>
          <bitfield name="SSL" caption="SPI Select Low Interrupt Enable" mask="0x8"/>
          <bitfield name="ERROR" caption="Error Interrupt Enable" mask="0x80"/>
        </register>
        <register modes="USART" name="INTENCLR" offset="0x14" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="USART Interrupt Enable Clear">
          <bitfield name="DRE" caption="Data Register Empty Interrupt Enable" mask="0x1"/>
          <bitfield name="TXC" caption="Transmit Complete Interrupt Enable" mask="0x2"/>
          <bitfield name="RXC" caption="Receive Complete Interrupt Enable" mask="0x4"/>
          <bitfield name="RXS" caption="Receive Start Interrupt Enable" mask="0x8"/>
          <bitfield name="CTSIC" caption="Clear to Send Input Change Interrupt Enable" mask="0x10"/>
          <bitfield name="RXBRK" caption="Receive Break Interrupt Enable" mask="0x20"/>
          <bitfield name="ERROR" caption="Error Interrupt Enable" mask="0x80"/>
        </register>
        <register modes="I2CM" name="INTENSET" offset="0x16" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="I2CM Interrupt Enable Set">
          <bitfield name="MB" caption="Host on Bus Interrupt Enable" mask="0x1"/>
          <bitfield name="SB" caption="Client on Bus Interrupt Enable" mask="0x2"/>
          <bitfield name="ERROR" caption="Error Interrupt Enable" mask="0x80"/>
        </register>
        <register modes="I2CS" name="INTENSET" offset="0x16" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="I2CS Interrupt Enable Set">
          <bitfield name="PREC" caption="Stop Received Interrupt Enable" mask="0x1"/>
          <bitfield name="AMATCH" caption="Address Match Interrupt Enable" mask="0x2"/>
          <bitfield name="DRDY" caption="Data Ready Interrupt Enable" mask="0x4"/>
          <bitfield name="ERROR" caption="Error Interrupt Enable" mask="0x80"/>
        </register>
        <register modes="SPI" name="INTENSET" offset="0x16" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="SPI Interrupt Enable Set">
          <bitfield name="DRE" caption="Data Register Empty Interrupt Enable" mask="0x1"/>
          <bitfield name="TXC" caption="Transmit Complete Interrupt Enable" mask="0x2"/>
          <bitfield name="RXC" caption="Receive Complete Interrupt Enable" mask="0x4"/>
          <bitfield name="SSL" caption="SPI Select Low Interrupt Enable" mask="0x8"/>
          <bitfield name="ERROR" caption="Error Interrupt Enable" mask="0x80"/>
        </register>
        <register modes="USART" name="INTENSET" offset="0x16" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="USART Interrupt Enable Set">
          <bitfield name="DRE" caption="Data Register Empty Interrupt Enable" mask="0x1"/>
          <bitfield name="TXC" caption="Transmit Complete Interrupt Enable" mask="0x2"/>
          <bitfield name="RXC" caption="Receive Complete Interrupt Enable" mask="0x4"/>
          <bitfield name="RXS" caption="Receive Start Interrupt Enable" mask="0x8"/>
          <bitfield name="CTSIC" caption="Clear to Send Input Change Interrupt Enable" mask="0x10"/>
          <bitfield name="RXBRK" caption="Receive Break Interrupt Enable" mask="0x20"/>
          <bitfield name="ERROR" caption="Error Interrupt Enable" mask="0x80"/>
        </register>
        <register modes="I2CM" name="INTFLAG" offset="0x18" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="I2CM Interrupt Flag Status and Clear">
          <bitfield name="MB" caption="Host on Bus" mask="0x1"/>
          <bitfield name="SB" caption="Client on Bus" mask="0x2"/>
          <bitfield name="ERROR" caption="Error" mask="0x80"/>
        </register>
        <register modes="I2CS" name="INTFLAG" offset="0x18" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="I2CS Interrupt Flag Status and Clear">
          <bitfield name="PREC" caption="Stop Received" mask="0x1"/>
          <bitfield name="AMATCH" caption="Address Match" mask="0x2"/>
          <bitfield name="DRDY" caption="Data Ready" mask="0x4"/>
          <bitfield name="ERROR" caption="Error" mask="0x80"/>
        </register>
        <register modes="SPI" name="INTFLAG" offset="0x18" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="SPI Interrupt Flag Status and Clear">
          <bitfield name="DRE" caption="Data Register Empty" mask="0x1"/>
          <bitfield name="TXC" caption="Transmit Complete" mask="0x2"/>
          <bitfield name="RXC" caption="Receive Complete" mask="0x4"/>
          <bitfield name="SSL" caption="SPI Select Low" mask="0x8"/>
          <bitfield name="ERROR" caption="Error" mask="0x80"/>
        </register>
        <register modes="USART" name="INTFLAG" offset="0x18" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="USART Interrupt Flag Status and Clear">
          <bitfield name="DRE" caption="Data Register Empty" mask="0x1"/>
          <bitfield name="TXC" caption="Transmit Complete" mask="0x2"/>
          <bitfield name="RXC" caption="Receive Complete" mask="0x4"/>
          <bitfield name="RXS" caption="Receive Start" mask="0x8"/>
          <bitfield name="CTSIC" caption="Clear to Send Input Change" mask="0x10"/>
          <bitfield name="RXBRK" caption="Receive Break" mask="0x20"/>
          <bitfield name="ERROR" caption="Error" mask="0x80"/>
        </register>
        <register modes="I2CM" name="STATUS" offset="0x1A" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="I2CM Status">
          <bitfield name="BUSERR" caption="Bus Error" mask="0x1"/>
          <bitfield name="ARBLOST" caption="Arbitration Lost" mask="0x2"/>
          <bitfield name="RXNACK" caption="Received Not Acknowledge" mask="0x4"/>
          <bitfield name="BUSSTATE" caption="Bus State" mask="0x30" values="SERCOM_I2CM_STATUS__BUSSTATE"/>
          <bitfield name="LOWTOUT" caption="SCL Low Time-Out" mask="0x40"/>
          <bitfield name="CLKHOLD" caption="Clock Hold" mask="0x80"/>
          <bitfield name="MEXTTOUT" caption="Host SCL Low Extend Time-Out" mask="0x100"/>
          <bitfield name="SEXTTOUT" caption="Client SCL Low Extend Time-Out" mask="0x200"/>
          <bitfield name="LENERR" caption="Transaction Length Error" mask="0x400"/>
        </register>
        <register modes="I2CS" name="STATUS" offset="0x1A" rw="RW" size="2" initval="0x0000" caption="I2CS Status">
          <bitfield name="BUSERR" caption="Bus Error" mask="0x1"/>
          <bitfield name="COLL" caption="Transmit Collision" mask="0x2"/>
          <bitfield name="RXNACK" caption="Received Not Acknowledge" mask="0x4"/>
          <bitfield name="DIR" caption="Read / Write Direction" mask="0x8"/>
          <bitfield name="SR" caption="Repeated Start" mask="0x10"/>
          <bitfield name="LOWTOUT" caption="SCL Low Time-out" mask="0x40"/>
          <bitfield name="CLKHOLD" caption="Clock Hold" mask="0x80"/>
          <bitfield name="SEXTTOUT" caption="Client SCL Low Extend Time-Out" mask="0x200"/>
        </register>
